---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.DimensionLocked
enum: Autodesk.Revit.DB.Fabrication.FabricationPartFitResult
source: html/36a9c1b4-343e-c0ce-fd27-8b42b8a82288.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.DimensionLocked

Failed due to not being able to change a locked or product listed dimension.